# IsValidCategoryForFilterBySheet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsValidCategoryForFilterBySheet Method
ScheduleDefinition Class See Also
---
Checks whether a schedule can be filtered by sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsValidCategoryForFilterBySheet()
```

Visual Basic
---
```text
Public Function IsValidCategoryForFilterBySheet As Boolean
```

Visual C++
---
```text
public:
bool IsValidCategoryForFilterBySheet()
```

# ### Return Value
True if the schedule can be filtered by sheet, false otherwise.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace